Revit 2017 API
IExternalResourceUIServer Methods
The IExternalResourceUIServer type exposes the following members.
Methods
Name | Description
GetDBServerId
 Implement this method to return the id of the server which is associated with this UI server.
GetDescription
 Implement this method to return a description of the server.
 (Inherited from IExternalServer.)
GetName
 Implement this method to return the name of the server.
 (Inherited from IExternalServer.)
GetServerId
 Implement this method to return the id of the server.
 (Inherited from IExternalServer.)
GetServiceId
 Implement this method to return the id of the service.
 (Inherited from IExternalServer.)
GetVendorId
 Implement this method to return the id of the vendor of the server.
 (Inherited from IExternalServer.)
HandleBrowseResult
 Implement this method to handle browsing external resources operation result.
HandleLoadResourceResults
See Also
IExternalResourceUIServer Interface
Autodesk.Revit.UI Namespace